---
kind: property
id: P:Autodesk.Revit.DB.Visual.AssetProperty.Name
source: html/57ab6af1-a4eb-8973-33b5-9a1f38796679.htm
---
# Autodesk.Revit.DB.Visual.AssetProperty.Name Property

Get the name of the AssetProperty

## Syntax (C#)
```csharp
public string Name { get; }
```